a = int(input("Введите число метров:")) 
x = str(input("Выберите формат перевода(см, дм, ярды или дюймы): ")) 
y = int(input("Выберите количество знаков после запятой")) 
if (x == "см"):
    print(a, "метров равно",round(a, y) * 100, "сантиметров")
elif (x == "дм"):
    print(a, "метров равно", round(a, y) * 10, "дециметров")
elif (x == "ярды"):
    print(a, "метров равно", round((a * 100)/91.44, y), "ярдов")
elif (x == "дюймы"):
    print(a, "метров равно", round(a * 39.3701, y), "дюймов")
else:
    print("Введите правильный формат перевода единицы")
    
