r = int(input("Введите радиус конуса:")) 
h = int(input("Введите высоту конуса:")) 
l = int(input("Введите длину окружности конуса:")) 
import math
pi = math.pi
V = 1/3 * pi * r ** (2) * h
Sf = 1/3 * pi * r * l
So = pi * r ** 2
L = 2 * pi * r
c = int(input("Введите во сколько раз необходимо увеличить радиус окружности:")) 
r1 = r * c
Vi = 1/3 * pi * r1 ** (2) * h 
Vo = Vi / V
print("Площадь основания конуса равна", So)
print("Длина основания конуса равна", L)
print("При увеличение радиуса на ",c, "объем конуса измениться в ",Vo, "раз")
print("Объем конуса равен", V)
print("Площадь боковой поверхности конуса равна", Sf)

